let Groups = dynamic([
  "retail-iam-GRP_BR_STORE_EMPLOYEE",
  "retail-iam-GRP_BR_STORE_MANAGER"
]);
AuditLogs
| where TimeGenerated > ago(24h)
| where Category == "GroupManagement"
| where OperationName in ("Add member to group", "Remove member from group")
| mv-expand TR = TargetResources
| where tostring(TR.displayName) in (Groups)
| project TimeGenerated, OperationName, Group=tostring(TR.displayName), InitiatedBy
| order by TimeGenerated desc
